#include"supermarket.h"

void display()
{
	printf("     \t┏━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
    printf("     \t┃                                                  ┃\n");
    printf("     \t┃               欢迎进入货架管理系统               ┃\n");
    printf("     \t┃                                                  ┃\n");
    printf("     \t┗━━━━━━━━━━━━━━━━━━━━━━━━━┛\n\n\n");
	printf("\t\t--------------------------------------\n");
	printf("\t\t-----------1         进入-----------\n");
    printf("\t\t-----------0       退出系统-----------\n");
	printf("\t\t\t**请输入所选功能代号**\n");
}

void play0(){
	printf("\t\t----------------------------------------\n");
	printf("\t\t-----------1             创建-----------\n");
	printf("\t\t-----------2             删除-----------\n");
	printf("\t\t-----------3             添加-----------\n");
	printf("\t\t-----------4             修改-----------\n");
	printf("\t\t-----------5             库存-----------\n");
	printf("\t\t-----------6             需求-----------\n");
	printf("\t\t-----------0           退出系统-----------\n");
	printf("\t\t-----------请输入所选功能代号-----------\n");
} 

 
