#include"res.h"

/*总界面*/ 
void display()
{   printf("\n\n\n\n\n"); 
	printf("    \t\t┏━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
    printf("    \t\t┃                                                  ┃\n");
    printf("    \t\t┃             **欢迎进入餐厅点餐系统**             ┃\n");
    printf("    \t\t┃                                                  ┃\n");
    printf("    \t\t┗━━━━━━━━━━━━━━━━━━━━━━━━━┛\n\n\n");
	printf("\t\t\t-------------------------------------\n");
	printf("\t\t\t欢迎使用自助服务，请根据需求选择\n");
	printf("\t\t\t-----------1       管理员-----------\n");
	printf("\t\t\t-----------2       服务员-----------\n");
	printf("\t\t\t-----------3        顾客------------\n"); 
	printf("\t\t\t-----------0       退出系统---------\n");
	printf("\t\t\t********请输入所选功能代号********\n");
}

/*管理员界面*/ 
void play0(){
	printf("\t\t------------------------------------------\n");
	printf("\t\t欢迎使用管理服务，请根据需求选择\n");
	printf("\t\t-----------1            管理员相关----------\n");
	printf("\t\t-----------2             菜单相关-----------\n");
	printf("\t\t-----------3           顾客信息浏览---------\n");
	printf("\t\t-----------4             统计点餐-----------\n");
	printf("\t\t-----------5           评分评价查看---------\n");
	printf("\t\t-----------6             账务查看---------\n");
	printf("\t\t-----------0                退出------------\n");
	printf("\t\t********请输入所选功能代号********\n");
} 

/*服务员界面*/ 
void play1(){
	printf("\t\t-------------------------------------------\n");
	printf("\t\t欢迎使用服务员功能，请根据需求选择\n");
	printf("\t\t-----------1           顾客信息录入---------\n");
	printf("\t\t-----------2             菜单相关-----------\n");
	printf("\t\t-----------3               点餐-------------\n");
	printf("\t\t-----------0               退出-------------\n");
    printf("\t\t*********请输入所选功能代号*********\n");
}

/*顾客自助界面*/ 
void play3(){
	printf("\t\t------------------------------------------\n");
	printf("\t\t欢迎使用顾客自助功能，请根据需求选择\n");
	printf("\t\t-----------1           投诉和建议----------\n");
	printf("\t\t-----------2            菜品评分-----------\n");
    printf("\t\t-----------0               退出------------\n");
    printf("\t\t********请输入所选功能代号*********\n");
}
