
#include"bank.h"
void display()
{
	printf("     \t┏━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
    printf("     \t┃                                                  ┃\n");
    printf("     \t┃               欢迎进入银行操作系统               ┃\n");
    printf("     \t┃                                                  ┃\n");
    printf("     \t┗━━━━━━━━━━━━━━━━━━━━━━━━━┛\n\n\n");
	printf("\t\t--------------------------------------\n");
	printf("\t\t欢迎使用本银行的自助服务，根据需求选择\n");
	printf("\t\t-----------1       管理人员-----------\n");
	printf("\t\t-----------2       自助服务-----------\n");
	printf("\t\t-----------0       退出系统-----------\n");
	printf("\t\t\t**请输入所选功能代号**\n");
}

void play0(){
	printf("\t\t----------------------------------------\n");
	printf("\t\t欢迎使用本银行的管理服务，请根据需求选择\n");
	printf("\t\t-----------1             开户-----------\n");
	printf("\t\t-----------2             销户-----------\n");
	printf("\t\t-----------3             账务-----------\n");
	printf("\t\t-----------4           (解)挂失-----------\n");
	printf("\t\t-----------5           账目统计-----------\n");
	printf("\t\t-----------0           退出系统-----------\n");
	printf("\t\t-----------请输入所选功能代号-----------\n");
} 

void play1(){
	printf("\t\t----------------------------------------\n");
	printf("\t\t欢迎使用本银行的管理服务，请根据需求选择\n");
	printf("\t\t-----------1             改密-----------\n");
	printf("\t\t-----------2             余额-----------\n");
	printf("\t\t-----------3             账单-----------\n");
	printf("\t\t-----------0             返回-----------\n");
	printf("\t\t-----------请输入所选功能代号-----------\n");
}
 
